{
  "people": [
    {
      "name": "William Tomlinson, Ph.D",
      "picture": "../../img/team/WillTomlinson.jpg",
      "role": "Director",
      "email": "willjt@bu.edu"
    },
    {
      "name": "Jeff Simeon",
      "picture": "../../img/team/JeffSimeon.jpg",
      "role": "Associate Director, Programs & Product Management",
      "email": "simeon@bu.edu"
    },
    {
      "name": "Greg Frasco",
      "picture": "../../img/team/GregFrasco.jpg",
      "role": "Associate Director of Engineering",
      "email": "frascog@bu.edu"
    },
    {
      "name": "Arezoo Sadeghi",
      "picture": "../../img/team/ArezooSadeghi.jpg",
      "role": "Senior Software Engineer",
      "email": "asadeg02@bu.edu"
    },

    {
      "name": "Hazim Ab Halim",
      "picture": "../../img/team/HazimAbHalim.jpg",
      "role": "Software Engineer",
      "email": "zimlim@bu.edu"
    },
    {
      "name": "Collin Bolles",
      "picture": "../../img/team/CollinBolles.jpg",
      "role": "Software Engineer",
      "email": "cbolles@bu.edu"
    },
    {
      "name": "Manny Akosah",
      "picture": "../../img/team/MannyAkosah.jpg",
      "role": "Software Engineer",
      "email": "mannysa@bu.edu"
    },
    {
      "name": "Harunobu Ishii",
      "picture": "../../img/team/HarunobuIshii.jpg",
      "role": "Software Engineer",
      "email": "hishii@bu.edu"
    },
    {
      "name": "Asad Malik",
      "picture": "../../img/team/AsadMalik.jpg",
      "role": "Software Engineer",
      "email": "am5815@bu.edu"
    },
    {
      "name": "Karina Hickman",
      "picture": "../../img/team/KarinaHickman.jpg",
      "role": "Technical Project Associate",
      "email": "khickman@bu.edu"
    },
    {
      "name": "Wenhan Wang",
      "picture": "../../img/team/WenhanWang.jpg",
      "role": "Software Engineer",
      "email": "wenhwang@bu.edu"
    },
    {
      "name": "Zoe Chitty",
      "picture": "../../img/team/ZoeChitty.jpg",
      "role": "Software Engineer",
      "email": "zlch@bu.edu"
    },
    {
      "name": "Shashank Karthikeyan",
      "picture": "../../img/team/ShashankKarthikeyan.jpg",
      "role": "Software Engineer",
      "email": "karthish@bu.edu"
    }
  ],
  "projects": [
    {
      "featured": true,
      "title": "Web MPC",
      "titleDescription": "Secure Compensation Analytics for the City of Boston",
      "description": "In support of the Boston Women’s Workforce Council and its mission to advance salary equity among Boston employers as part of the 100% Talent Compact, SAIL staff and student developers built a secure multi-party computation web application that allows statistical data pertaining to compensation levels across genders and demographics to be collected from over 250 participating employer organizations, such as State Street Corporation and Putnam Investments, without requiring any organization to reveal its confidential data. This platform is unique in that it allows real-world organizations to use what is still largely studied as a theoretical technique, enabling analyses that would have been otherwise impossible to do while preserving the confidentiality of the participants.",
      "href": "../../../img/projects/illustrations/graph.png",
      "projectType": "Privacy and Security",
      "pi": ["Boston Women's Workforce Council"],
      "metaDataPresentation": [
        {
          "name": "From Usability to Secure Computing and Back Again",
          "href": "https://www.usenix.org/conference/soups2019/presentation/qin"
        }
      ],
      "metaDataPublication": [
        {
          "name": "Role-Based Ecosystem for the Design, Development, and Deployment of Secure Multi-Party Data Analytics Applications",
          "href": "https://ieeexplore.ieee.org/document/8901614"
        }
      ]
    },
    {
      "featured": true,
      "title": "ASL-LEX",
      "titleDescription": "Illuminating the Language of Signs, Sign by Sign",
      "description": "Introducing ASL-LEX, a dynamic database capturing the intricate lexical and phonological facets of American Sign Language signs. Originally unveiled in 2016 with a robust collection of nearly 1,000 signs, ASL-LEX embarked on an ambitious journey in Fall 2020. This update witnessed a substantial expansion, enriching its repository to a staggering 2,723 signs. As we continue to enhance ASL-LEX, it serves as a remarkable resource, illuminating the depth and diversity of American Sign Language, making it accessible to a broader audience and fostering a deeper understanding of this expressive language.",
      "href": "../../../img/projects/illustrations/sorting.png",
      "projectType": "Data Science",
      "pi": ["Dr. Naomi Caselli, Assistant Professor, Wheelock"],
      "metaDataPresentation": [],
      "metaDataPublication": []
    },
    {
      "featured": true,
      "title": "Camera Mouse",
      "titleDescription": "Enhancing Accessibility through Eye Movements Tracking",
      "description": "Introducing 'Camera Mouse', a collaborative achievement between our team and Professor Margrit Betke, a distinguished Computer Science professor and co-leader of the Image and Video Computing Research Group at Boston University. This innovative software harnesses camera-based eye tracking, enabling effortless computer navigation without the need to lift a finger. The project's core mission is to enhance accessibility, seamlessly merging technological sophistication with user inclusivity. Camera Mouse is a significant step forward in redefining how we interact with computers, offering a more accessible and user-friendly digital experience.",
      "href": "../../../img/projects/illustrations/cameraman.webp",
      "projectType": "Data Science",
      "pi": [
        "Dr. Margrit Betke, Professor of Computer Science, Boston University"
      ],
      "metaDataPresentation": [],
      "metaDataPublication": []
    },
    {
      "title": "PACT",
      "titleDescription": "Elevate Thermal Simulations with PACT",
      "description": "PACT was previously difficult to run since it has a myriad of dependencies in addition to relying on a strict system configurations to run smoothly. SAIL engineering intern Joreen containerized PACT codebase to make it easier to run. The work done by SAIL simplified the running process to the bare minimum: now, a user only has to provides input files and run a single command. Moreover, the new containerized PACT is platform agnostic, running on any OS with no specialized configurations.",
      "href": "../../../img/projects/illustrations/startup.png",
      "projectType": "Data Science",
      "pi": [
        "Ayse K. Coskun, Professor of Computer Engineering, Boston University"
      ],
      "metaDataPresentation": [],
      "metaDataPublication": []
    },
    {
      "title": "TPAT",
      "titleDescription": "Teacher Performance and Assessment Training",
      "description": "TPAT, the Teacher Performance and Assessment Training web application, is a testament to SAIL's commitment to precision and user-centric design. From crafting design directions based on client inspiration to seamlessly integrating webcam recording and future-enhancement possibilities, SAIL's meticulous approach ensures a comprehensive and adaptable platform. Our efforts extend beyond development, as we install and maintain TPAT on robust infrastructure and implement feedback-driven adjustments to provide a seamless user experience.",
      "href": "../../../img/projects/illustrations/promotion.png",
      "projectType": "Ed Tech",
      "pi": null,
      "metaDataPresentation": [],
      "metaDataPublication": []
    },
    {
      "title": "SIEVE",
      "titleDescription": "Redefining Zero-Knowledge Proof Tech",
      "description": "SIEVE, led by our TA1 team, is a dynamic project marked by innovation and collaboration. We specialize in Python and utilize the versatile 'picozk' module, authored by Joe Near (a key member of TA1 and TA2). Our mission: to craft zk-friendly intermediate representations (IRs) – relations, witnesses, and instances. These meticulously generated IRs serve as the foundation for TA2's powerful backends, including 'mac-and-cheese'. Prior to backend implementation, we rigorously test IR formats using 'fire-alarm'.",
      "href": "../../../img/projects/illustrations/search.png",
      "projectType": "Privacy and Security",
      "pi": null,
      "metaDataPresentation": [],
      "metaDataPublication": []
    },
    {
      "title": "Wage Gap Calculator",
      "titleDescription": "Empowering Employers to Bridge Wage Gaps",
      "description": "The Wage Gap Calculator project, undertaken in collaboration with the Boston Women’s Workforce Council (BWWC), addresses the pressing need to close gender and racial wage gaps in Boston and beyond. BWWC's Compact Signers commit to various actions, including internal wage gap analysis, yet many struggle with this crucial step. To simplify the process and encourage consistent analysis, the Wage Gap Calculator offers an interactive tool akin to the Fidelity retirement calculator. Its mission is to empower employers throughout Massachusetts and beyond to calculate their internal wage gaps effectively, ultimately advancing the cause of wage equality.",
      "href": "../../../img/projects/illustrations/coins.png",
      "projectType": "Data Science",
      "pi": null,
      "metaDataPresentation": [],
      "metaDataPublication": []
    },
    {
      "featured": true,
      "title": "Noise Score",
      "titleDescription": "Describe and Visualize Your Daily Soundscape",
      "description": "Research has established that the environmental soundscape has a large impact on our stress levels, our sleep, and our cardiovascular and mental health. The NoiseScore application utilizes smart phone technology to capture both the objective and subjective nature of the sounds you encounter as you go about your daily routine. This information can be utilized to understand the spatial and temporal distribution of sound levels and noise perception in your community both overall and by specific sources such as loud parties, road traffic, or aircraft noise.",
      "href": "../../../img/projects/illustrations/notification.png",
      "projectType": "Digital Health",
      "pi": [
        "Dr. Erica Walker, Assistant Professor of Epidemiology, Brown University"
      ],
      "metaDataPresentation": [
        {
          "name": "",
          "href": ""
        }
      ],
      "metaDataPublication": [
        {
          "name": "",
          "href": ""
        }
      ]
    },
    {
      "title": "Cookie Monster",
      "titleDescription": "Unraveling the Digital Snack",
      "description": "In a collaborative effort led by Andrey Fradkin, Assistant Professor of Economics at Boston University, along with Chiara Farronato, Associate Professor of Business Administration at Harvard Business School, and Tesary Lin, Assistant Professor of Marketing at BU, this project introduces a Chrome extension designed to investigate the impact of cookie tracking on user experiences and explore advertising mechanisms. This innovative tool discreetly collects data on ads and user interactions during web browsing sessions, ensuring user privacy. By examining the implications of cookie tracking and the data collection practices of search engines, this research promises valuable insights into the digital landscape and its future implications for users and industry practices.",
      "href": "../../../img/projects/illustrations/shield.png",
      "projectType": "Data Science",
      "pi": [
        "Andrey Fradkin, Assistant Professor of Economics at Boston University",
        "Chiara Farronato, Glenn and Mary Jane Creamer Associate Professor of Business Administration at Harvard Business School",
        "Tesary Lin, Assistant Professor of Marketing at Boston University"
      ],
      "metaDataPresentation": [],
      "metaDataPublication": []
    },
    {
      "featured": true,
      "title": "Shipley",
      "titleDescription": "Revealing Media Biases",
      "description": "Shipley, a groundbreaking platform, confronts racial bias within news articles. Offering two user views, it empowers local newsrooms to internally evaluate and address racial bias while allowing organizations like the NAACP to analyze data across geographic regions. Led by a dedicated team of SAIL engineers, the project employs machine learning and data science to gain insights into demographic portrayals in media coverage. Goals include developing an analysis tool, highlighting disparities in Boston's media coverage, and identifying correlations between specific regions and media representation, emphasizing demographics. Shipley is a pivotal step towards promoting fairness in journalism and media reporting through innovative, data-driven methods.",
      "href": "../../../img/projects/illustrations/binoculars.webp",
      "projectType": "Data Science",
      "pi": [
        "Ziba Cranmer, Director of BU Spark!",
        "Paul Singer, Investigations and Impact Editor at GBH",
        "Tanisha Sullivan, President of Boston NAACP Chapter"
      ],
      "metaDataPresentation": [],
      "metaDataPublication": []
    },
    {
      "title": "VA App",
      "titleDescription": "Veterans Empowered, Homes Secured",
      "description": "The VA App is a mobile application dedicated to ending veteran homelessness by allowing U.S. veterans to share their daily experiences and challenges through surveys. Through real-time data collection and analysis, this project seeks to uncover patterns that link survey responses with housing situations, thus informing targeted support and prevention strategies. With a focus on understanding precursors to homelessness, tailoring support, and implementing proactive measures, the VA App empowers veterans and plays a pivotal role in shaping policies and programs aimed at ensuring they receive the care and support they rightfully deserve.",
      "href": "../../../img/projects/illustrations/house.webp",
      "projectType": "Digital Health",
      "pi": [
        "Donald Keith McInnes, Research Associate Professor, Boston University School of Public Health"
      ],
      "metaDataPresentation": [],
      "metaDataPublication": []
    },
    {
      "title": "Microb-DB",
      "titleDescription": "Simplifying Genomic Insights for Scientists",
      "description": "Microb-DB is a practical project connecting genomics and metagenomics, utilizing data from well-known genome databases like GOLD and GTDB. We aim to simplify research by collecting and organizing valuable metagenomic insights into one database—Microb-DB. This resource is designed to assist researchers and scientists working with genomes and metagenomes. It allows users to perform custom queries on a user-friendly platform, promoting comparative genomics, aiding metagenomic studies, and supporting data-driven discoveries. Microb-DB is created to streamline research, inform decisions, and encourage collaboration among scientists from different fields, making it a valuable tool for advancing our knowledge of microorganisms and their roles in various environments.",
      "href": "../../../img/projects/illustrations/funnel.png",
      "projectType": "Natural Sciences",
      "pi": [
        "Dr. Marianna Felici, Research Scientist at the Center for Space Physics at Boston University"
      ],
      "metaDataPresentation": [],
      "metaDataPublication": []
    },
    {
      "title": "Storm-Chaser",
      "titleDescription": "Automating Microscopy",
      "description": "In collaboration with Brian Cleary, a computing and data science faculty member, we designed and developed a desktop application for automating lab-based microscopy experiments, specifically for measuring gene expression in tissue sections. Our work led to the creation of an open-source software repository, focusing on complex, high-throughput experiments with low-latency requirements. The application, as a minimum viable product, supports predefined experiments across multiple rounds and allows for flexible measurement location adjustments in x, y, and z. We also performed a comprehensive review of the existing repository to assess updates versus new development needs, aligning with its original goal of supporting future software additions. Additionally, we produced a Windows application to enhance accessibility, updated drivers for hardware compatibility, and implemented a study notification feature for timely feedback to researchers upon study completion or failure.",
      "href": "../../../img/projects/illustrations/laptop.png",
      "projectType": "Natural Sciences",
      "pi": [
        "Brian Cleary, Assistant Professor in Department of Biomedical Engineering and Center for Computing and Data Science"
      ],
      "metaDataPresentation": [],
      "metaDataPublication": []
    },
    {
      "featured": true,
      "title": "NIST",
      "titleDescription": "Uniting Data, Advancing Collaboration",
      "description": "Under the leadership of Boston University's Douglas Densmore, our ongoing NIST project focuses on creating a computational infrastructure with two core objectives. The first involves establishing a collaborative 'data backbone', a web-based platform for all project contributors to share, manage, and standardize data exchange processes. This repository stores various crucial data, from production timelines to structural details. The second objective is to develop a 'software pipeline' that connects this backbone to techno-economic modeling frameworks, supporting both manual and automated analysis. This infrastructure, complete with process flowsheets, aims to eventually integrate with molecular biology experimental design software. Our project aims to facilitate seamless collaboration and provide advanced data management and analysis tools through a cloud-based web application with secure logins, robust file storage, and intuitive data viewing.",
      "href": "../../../img/projects/illustrations/teamwork.png",
      "projectType": "Natural Sciences",
      "pi": [
        "Douglas Densmore, Professor of Electrical and Computer Engineering at Boston University"
      ],
      "metaDataPresentation": [],
      "metaDataPublication": []
    },
    {
      "title": "COMETS",
      "titleDescription": "Precision Microbial Growth Simulation",
      "description": "COMETS represents an advanced simulation tool meticulously designed to replicate the growth patterns of microbes. This intricate simulation process demands substantial computational resources and time; however, the outcomes promise to significantly enhance users' research endeavors. Our primary deliverable is a user-friendly web application, purpose-built for conducting COMETS simulations with ease. This application provides a range of input mechanisms, including sliders, radio boxes, and checkboxes, empowering users to manipulate simulation variables effortlessly. Given the resource-intensive nature of these simulations, we prioritize efficiency by focusing on lightweight simulations, characterized by output sizes below 1GB and computation times less than 5 minutes. Further details and restrictions will be fine-tuned in collaboration with our project lead in later project stages.                                                Our project goals encompass the development of a web application for initiating COMETS simulations, displaying resulting simulations—comprising graphs, models, and other relevant outputs—and establishing a robust CI/CD pipeline that evolves alongside COMETS. Furthermore, we aim to deploy both the front-end and back-end components of this application on a remote server, ensuring accessibility and scalability for researchers.",
      "href": "../../../img/projects/illustrations/archery.webp",
      "projectType": "Natural Sciences",
      "pi": [
        "Iljia Dukovski, Research Assistant Professor, Bioinformatics Program at Boston University"
      ],
      "metaDataPresentation": [],
      "metaDataPublication": []
    },
    {
      "title": "Climate Lies",
      "titleDescription": "Unmasking Misinformation",
      "description": "This project utilizes dynamic and interactive visualization to expose climate disinformation sourced from Twitter posts spanning from February 2007 to December 2022. This data-driven tool was prominently featured at the May 16 Symposium on 'Misinformation in an Era of Climate Crisis', hosted at the BU Center for Computing and Data Science. The visualization provides a clear and factual representation of the prevalence of climate-related falsehoods, aiding in raising awareness and fostering informed discussions on the critical issue of climate change misinformation.",
      "href": "../../../img/projects/illustrations/navigation-lost.png",
      "projectType": "Data Science",
      "pi": [
        "Irena Vodenska, Professor of Finance at Boston University, Director of Finance Programs",
        "Hyunuk Kim, Assistant Professor, Department of Administrative Sciences, Metropolitan College"
      ],
      "metaDataPresentation": [],
      "metaDataPublication": []
    },
    {
      "title": "Web OMM",
      "titleDescription": "Money Management and Mind Wellness",
      "description": "The Web OMM project is a pioneering initiative aimed at leveraging user activity data on a simulated financial website to achieve two vital goals. Firstly, it focuses on measuring and enhancing financial literacy, equipping users with the knowledge and tools to make informed financial decisions. Secondly, it plays a crucial role in early detection of cognitive decline, particularly in older adults, using data-driven insights. By migrating the existing mock financial platform to the web, and introducing new features while addressing existing issues, Web OMM is dedicated to providing a modern and efficient financial management tool. Explore the project's website at https://omm.sail.codes to experience the future of online money management and cognitive health monitoring.",
      "href": "../../../img/projects/illustrations/task-management.png",
      "projectType": "Digital Health",
      "pi": [
        "Preeti Sunderaraman, Assistant Professor of Neurology at Boston University",
        "Kriti Goyal, Research Specialist at Boston University",
        "Madison Bouchard-Liporto, Research Assistant at Boston University"
      ],
      "metaDataPresentation": [],
      "metaDataPublication": []
    },
    {
      "featured": true,
      "title": "fNIRS",
      "titleDescription": "Streamlining Brain Imaging Data",
      "description": "The fNIRS project aims to simplify the management of fNIRS Datasets for the imaging community. Through a user-friendly web interface, our platform enables users to effortlessly create, manage, download, and share fNIRS Datasets, conforming to the hierarchical structure of Subjects, Sessions, Runs, SNIRF files, and BIDS text files. By encapsulating the BIDS format, the interface provides a streamlined view of the data and facilitates BIDS text file editing. Users can efficiently generate BIDS datasets by uploading SNIRF files, ensuring data accuracy through validation and the automatic generation of BIDS format files. The platform's flexibility allows users to customize dataset structures by adding, removing, or rearranging Subjects, Sessions, or Runs within a Dataset, fostering enhanced collaboration and research efficiency within the fNIRS community.",
      "href": "../../../img/projects/illustrations/navigating.png",
      "projectType": "Digital Health",
      "pi": [
        "David Boas, Professor, Biomedical Engineering at Boston University, Director of Neurophotonics Center"
      ],
      "metaDataPresentation": [],
      "metaDataPublication": []
    },
    {
      "featured": true,
      "title": "Center for Young Colorful Minds",
      "titleDescription": "Youth Mental Wellness Hub",
      "description": "The 'Center for Young Colorful Minds (CYCM)' addresses the mental health crisis among youth of color and LGBTQ youth in Greater Boston and beyond. Our mission revolves around advancing mental health literacy and awareness through a dynamic online presence, focusing on culturally relevant mental health information, community engagement, and research initiatives. Collaborating with a youth advisory board and community partners, we disseminate accurate mental health content on social media. In addition, we strengthen ties with existing community programs, like the Boys and Girls Club, schools, and churches, to provide vital support. CYCM is also committed to research partnerships with academic institutions to develop evidence-based interventions that cater to the unique mental health needs of diverse youth. Our holistic approach empowers these communities by fostering resilience and well-being through knowledge, community, and research-backed initiatives.",
      "href": "../../../img/projects/illustrations/chat.webp",
      "projectType": "Digital Health",
      "pi": [
        "Dr. Christine M. Crawford, Director of Medical Student Education and Assistant Professor of Psychiatry at Boston University",
        "Daisy Perez, Senior Research Manager at Department of Psychiatry, Assistant Professor at Boston University Chobanian & Avedisian School of Medicine",
        "Hannah Tremont, Public Health Post Writing Fellow at Boston University School of Public Health"
      ],
      "metaDataPresentation": [],
      "metaDataPublication": []
    },
    {
      "title": "BROC Online Inquiry System",
      "titleDescription": "Pioneering Enhanced Sample Discovery for FHS Research",
      "description": "The 'BROC' project aims to revolutionize sample discovery within the Framingham Heart Study (FHS) by delivering an interactive website that empowers users to access comprehensive information about available samples. Unlike the current manual system, our Online Inquiry System streamlines the process, allowing researchers to independently navigate and filter datasets, ensuring no critical information is overlooked. The project encompasses goals such as creating an interactive website with robust data filtering, implementing data anonymization, enhancing the MetaBase prototype, and deploying the system on a HIPAA-compliant server, all with the objective of optimizing sample discovery and research within the FHS community.",
      "href": "../../../img/projects/illustrations/location.png",
      "projectType": "Digital Health",
      "pi": [
        "Alvin Ang, Research Assistant Professor of Anatomy and Neurobiology at Boston University"
      ],
      "metaDataPresentation": [],
      "metaDataPublication": []
    },
    {
      "title": "RESTORE",
      "titleDescription": "Collaborating for Healing and Support with BMC",
      "description": "The RESTORE Center specializes in providing evidence-based outpatient treatments for adults grappling with posttraumatic stress disorder (PTSD) and diverse adverse experiences, offering invaluable training to BMC clinicians. Our collaborative project, 'RESTORE', is dedicated to developing an intuitive web application and portal that serves as the digital gateway for the Center. This platform seamlessly integrates a headless content management system, enabling administrators to manage the website effortlessly. It features language translation capabilities and utilizes SAIL's authentication microservice for secure admin access. Additionally, our responsibility extends to guiding design decisions and branding to ensure alignment with the Center's mission and values.",
      "href": "../../../img/projects/illustrations/message.png",
      "projectType": "Digital Health",
      "pi": [
        "Dr. Sarah E. Valentine, Assistant Professor in Psychiatry at Boston University School of Medicine, Clinical Psychologist at BMC",
        "Daisy Perez, Senior Research Manager at Department of Psychiatry, Assistant Professor at Boston University Chobanian & Avedisian School of Medicine",
        "Karlie Marrs, Health Outreach and Evaluation Coordinator at RESTORE Center",
        "Dr. Nuha Alshabani, Trauma in Context Postdoctoral Fellow in the Department of Psychiatry at BMC"
      ],
      "metaDataPresentation": [],
      "metaDataPublication": []
    },

    {
      "title": "MTSS",
      "titleDescription": "Unlocking Learning Insights",
      "description": "The MTSS (Multi-Tiered System of Supports) project is a user-friendly web-based platform meticulously designed to gather and manage data pertaining to students with learning disabilities. This platform isn't just a data repository; it's a dynamic knowledge hub that streamlines the collection, organization, and redistribution of a wide range of educational, cognitive, neuroimaging, qualitative, and other data types. Going beyond data storage, it also actively analyzes the information, unveiling valuable insights. This educational intervention-focused repository is led by the project's Principal Investigator, Hank Fien, a distinguished Professor in Educational Innovation at Boston University's Wheelock College of Education & Human Development, and the Director of the Wheelock Institute for the Science of Education (WISE). The MTSS project holds the potential to significantly impact how we support students with learning disabilities, offering a comprehensive and user-friendly solution for data management and analysis.",
      "href": "../../../img/projects/illustrations/security-key.png",
      "projectType": "Ed Tech",
      "pi": [
        "Hank Fien, Professor of Educational Innovation in the Teaching & Learning Department at Boston University Wheelock College, DIrector of the Wheelock Institute for the science of Education"
      ],
      "metaDataPresentation": [],
      "metaDataPublication": []
    },
    {
      "title": "Career Map",
      "titleDescription": "State Career Readiness",
      "description": "Career Map is a dynamic web-based interactive platform that provides valuable insights into the career readiness landscape of US states. This user-friendly map offers a comprehensive view of career readiness resources and policies for each state, allowing users to make informed comparisons and evaluate their performance in specific areas based on CCD center recommendations. Led by Dr. V. Scott Solberg, a respected professor in the Counseling Psychology and Applied Human Development Department at BU Wheelock College of Education & Human Development, Career Map is set to become an invaluable resource for understanding and enhancing career readiness across the nation.",
      "href": "../../../img/projects/illustrations/design.webp",
      "projectType": "Data Science",
      "pi": [
        "Dr. V. Scott Solberg, Professor in the Counseling Psychology and Applied Human Development Department at Boston University Wheelock College"
      ],
      "metaDataPresentation": [],
      "metaDataPublication": []
    },
    {
      "title": "EcoForecast",
      "titleDescription": "Nature's Predictive Trail",
      "description": "EcoForecast is an innovative initiative aimed at transforming ecological forecasting. Its mission is to develop and deploy accessible, scalable, and reusable community cyberinfrastructure, designed to generate ecological forecasts consistently and efficiently. At its core, EcoForecast features a cloud-native workflow, functioning asynchronously and with distributed execution, all orchestrated by a state-of-the-art scheduler. The project has two primary objectives: to support a pending NSF Science and Technology Center (STC) proposal and to create an agile, cloud-based system. Through a combination of containerization and elastic load balancing, this innovation promises to make ecological forecasting more accessible, accurate, and practical, significantly enhancing our understanding of the natural world and bolstering informed environmental decision-making. Join us on this transformative journey to advance ecological predictions and contribute to a sustainable future.",
      "href": "../../../img/projects/illustrations/tasks.png",
      "projectType": "Data Science",
      "pi": [
        "Michael Dietz, Associate Professor at Earth and Environment Department at Boston University"
      ],
      "metaDataPresentation": [],
      "metaDataPublication": []
    }
  ],
  "oldProjects": [
    {
      "title": "Anchor",
      "titleDescription": "Sailing SAIL's Creative Seas",
      "description": "Anchor serves as a robust and integral back-end development tool within SAIL, providing a versatile ecosystem of frameworks and libraries. This tool streamlines the creation of RESTful APIs, back-end data modeling, user authentication, authorization, email invitations, and automated database backups. Anchor further simplifies development with automatic, customizable admin UI views, enabling straightforward database CRUD operations through easy configurations. A cornerstone of numerous SAIL projects, Anchor plays a pivotal role in enhancing efficiency and innovation across the organization, it's an internally developed and used tool at SAIL.",
      "href": "../../../img/projects/illustrations/vacation.png",
      "projectType": "",
      "pi": null,
      "metaDataPresentation": [],
      "metaDataPublication": []
    },
    {
      "title": "COVID",
      "titleDescription": "Clinical Testing Lab",
      "description": "To repopulate our three campuses, resume residential learning and student activities, and reopen research labs and clinics, Boston University took a comprehensive, multipronged approach to protecting the health and safety of our community and the public at large. At the center of this effort is testing. Once it became clear the novel coronavirus would persist into the fall of 2020, the University rapidly stood up a clinical testing lab. In addition to a trained staff, the BU Clinical Testing Laboratory is using specialized robots to accelerate testing capacity and, importantly, return results by the end of the next day. SAIL staff was instrumental in developing the automated software and data pipeline central to the testing process.",
      "href": "../../../img/projects/illustrations/formula.webp",
      "projectType": "Digital Health",
      "pi": null,
      "metaDataPresentation": [],
      "metaDataPublication": []
    },
    {
      "title": "MTSS",
      "titleDescription": "Unlocking Learning Insights",
      "description": "The MTSS (Multi-Tiered System of Supports) project is a user-friendly web-based platform meticulously designed to gather and manage data pertaining to students with learning disabilities. This platform isn't just a data repository; it's a dynamic knowledge hub that streamlines the collection, organization, and redistribution of a wide range of educational, cognitive, neuroimaging, qualitative, and other data types. Going beyond data storage, it also actively analyzes the information, unveiling valuable insights. This educational intervention-focused repository is led by the project's Principal Investigator, Hank Fien, a distinguished Professor in Educational Innovation at Boston University's Wheelock College of Education & Human Development, and the Director of the Wheelock Institute for the Science of Education (WISE). The MTSS project holds the potential to significantly impact how we support students with learning disabilities, offering a comprehensive and user-friendly solution for data management and analysis.",
      "href": "../../../img/projects/illustrations/security-key.png",
      "projectType": "Ed Tech",
      "pi": [
        "Hank Fien, Professor of Educational Innovation in the Teaching & Learning Department at Boston University Wheelock College, DIrector of the Wheelock Institute for the science of Education"
      ],
      "metaDataPresentation": [],
      "metaDataPublication": []
    },
    {
      "title": "Career Map",
      "titleDescription": "State Career Readiness",
      "description": "Career Map is a dynamic web-based interactive platform that provides valuable insights into the career readiness landscape of US states. This user-friendly map offers a comprehensive view of career readiness resources and policies for each state, allowing users to make informed comparisons and evaluate their performance in specific areas based on CCD center recommendations. Led by Dr. V. Scott Solberg, a respected professor in the Counseling Psychology and Applied Human Development Department at BU Wheelock College of Education & Human Development, Career Map is set to become an invaluable resource for understanding and enhancing career readiness across the nation.",
      "href": "../../../img/projects/illustrations/design.webp",
      "projectType": "Data Science",
      "pi": [
        "Dr. V. Scott Solberg, Professor in the Counseling Psychology and Applied Human Development Department at Boston University Wheelock College"
      ],
      "metaDataPresentation": [],
      "metaDataPublication": []
    },
    {
      "title": "EcoForecast",
      "titleDescription": "Nature's Predictive Trail",
      "description": "EcoForecast is an innovative initiative aimed at transforming ecological forecasting. Its mission is to develop and deploy accessible, scalable, and reusable community cyberinfrastructure, designed to generate ecological forecasts consistently and efficiently. At its core, EcoForecast features a cloud-native workflow, functioning asynchronously and with distributed execution, all orchestrated by a state-of-the-art scheduler. The project has two primary objectives: to support a pending NSF Science and Technology Center (STC) proposal and to create an agile, cloud-based system. Through a combination of containerization and elastic load balancing, this innovation promises to make ecological forecasting more accessible, accurate, and practical, significantly enhancing our understanding of the natural world and bolstering informed environmental decision-making. Join us on this transformative journey to advance ecological predictions and contribute to a sustainable future.",
      "href": "../../../img/projects/illustrations/tasks.png",
      "projectType": "Data Science",
      "pi": [
        "Michael Dietz, Associate Professor at Earth and Environment Department at Boston University"
      ],
      "metaDataPresentation": [],
      "metaDataPublication": []
    },
    {
      "title": "Shape-Up",
      "titleDescription": "Fostering Urban Planning for Safer Communities",
      "description": "Shape-Up is a web-based analytical visualization tool developed in collaboration with Jonathan Jay, an Associate Professor at BU's School of Public Health in the Department of Community Health Problems. This project aims to uncover the intricate connection between a city's neighborhoods and the prevalence of gun violence. By scrutinizing physical properties such as park density and vacant building density, Shape-Up provides valuable insights into the factors influencing gun violence rates. Additionally, the tool identifies areas with high potential for targeted gun violence prevention efforts by enhancing their environmental physical attributes. Shape-Up is dedicated to fostering safer, more resilient communities.",
      "href": "../../../img/projects/illustrations/watering.png",
      "projectType": "Data Science",
      "pi": [
        "Jonathan Jay, Associate Professor at Boston University School of Public Health, at the Department of Community Health Problems"
      ],
      "metaDataPresentation": [],
      "metaDataPublication": []
    },
    {
      "title": "SUDTraining",
      "titleDescription": "Gateway to Substance Abuse Resources",
      "description": "SUDTraining is a comprehensive web-based platform that offers in-depth training and assessment in the fields of substance abuse and mental health disorders. With three distinct modules, registered users can engage in interactive training sessions, quizzes, and, upon successful completion of the entire course, earn certificates of achievement. The platform includes an intuitive admin and analytics dashboard enriched with various visualizations for a more insightful overview. Originally led by Thomas Andrew at BU School of Medicine, SUDTraining is now steered by Stephen Brady, an Associate Professor of Psychiatry at BU School of Medicine. As a collaborative endeavor, it strives to empower learners in these crucial domains.",
      "href": "../../../img/projects/illustrations/door.webp",
      "projectType": "Ed Tech",
      "pi": [
        "Stephen Brady, Associate Professor of Psychiatry at Boston University School of Medicine"
      ],
      "metaDataPresentation": [],
      "metaDataPublication": []
    },
    {
      "title": "Black Women's Health Study",
      "titleDescription": "Analytics and Advocacy",
      "description": "SAIL's contribution to The Black Women's Health Study project encompasses a sophisticated web-based platform designed for request tracking and data sharing, serving as a repository of comprehensive data related to the health of black women. This invaluable resource includes an analytics dashboard that provides key insights into shareable data, traffic, data usage, and data visualization, enhancing the understanding of this critical dataset. The request tracking process is divided into three distinct phases, comprising brief query submissions, concept proposal submission, and formal data requests. This initiative plays a pivotal role in advancing research and knowledge in the domain of black women's health.",
      "href": "../../../img/projects/illustrations/stars.png",
      "projectType": "Digital Health",
      "pi": [
        "Dr. Julie Palmer, Karin Grunebaum Cancer Research Professor at Boston University School of Medicine, Director of Slone Epidemiology Center, Co-Director of BU-BMC Cancer Center"
      ],
      "metaDataPresentation": [],
      "metaDataPublication": []
    }
  ],
  "projectsListed": [
    "Web MPC",
    "ASL-LEX",
    "Camera Mouse",
    "PACT",
    "TPAT",
    "SIEVE",
    "Wage Gap Calculator",
    "Noise Score",
    "Cookie Monster",
    "VA App",
    "Microb-DB",
    "Storm-Chaser",
    "NIST",
    "COMETS",
    "Climate Lies",
    "Web OMM",
    "fNIRS",
    "Center for Young Colorful Minds",
    "BROC Online Inquiry System",
    "RESTORE",
    "Shape-Up",
    "COVID",
    "Anchor",
    "SUDTraining",
    "Black Women's Health Study"
  ],
  "dataVisual": [
    {
      "header": "30+",
      "content": "Dynamic and enduring partnerships we've forged since 2022."
    },
    {
      "header": "40+",
      "content": "Ongoing and completed projects represent our commitment to innovation and excellence."
    },
    {
      "header": "100+",
      "content": "Faculty members we have had the pleasure collaborating with."
    }
  ],
  "aboutText": [
    "The Software & Application Innovation Lab (SAIL) is the premier professional research, software engineering, and consulting lab within the",
    "at Boston University. SAIL acts as both a driver and a collaborative partner in the creation of cutting-edge solutions for the data-driven, computational, and software engineering aspects of research across the university and beyond.",
    "As the desire for professional quality software applications and services continues to rise within the realm of academia, SAIL exists to develop production quality applications and services by leveraging industry-leading software development practices.",
    "If you would like to explore how SAIL can help you achieve your research objectives or would like to discuss what resources are available, please fill out a "
  ],
  "aboutIcons": [
    "Full Stack Web and Mobile App Development.",
    "Code Base Refactoring and Maintenance.",
    "Project and Product Management Guidance.",
    "Software Best Practice Consulting.",
    "Proposal and Grant Writing."
  ],
  "projectsPage": "SAIL is committed to developing open-source software products that have direct impacts on academic research, public service, and industry.",
  "peoplePage": [
    "OUR TEAM",
    "Who we are",
    "We are a company working on a multitude of interdisciplinary projects."
  ]
}
